Autodesk.Revit.DB.Plumbing.PipeSettings.SetFlowConvertionServerInfo(Autodesk.Revit.DB.MEPCalculationServerInfo)
Set the MEPServerInfo of the current plumbing flow convertion server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.IsAnalysisForClosedLoopHydronicPipingNetworksEnabled(Autodesk.Revit.DB.Document)
Indicates whether analysis for closed loop hydronic piping networks is enabled in the specified document.
ccda:
The document.
Returns:
Returns true if analysis for closed loop hydronic piping networks is enabled, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.SetPipeSlopes(System.Collections.Generic.IList{System.Double})
Set pipe slope values.
slopes:
Pipe slope values. Revit stores the slope value as a percentage (0-100).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Each value of the slopes must be between 0 and 100. Slope value is stored in percentage. e.g. 100 means 100%, and it is 45 degree.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation failed.
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.GetPipeSettings(Autodesk.Revit.DB.Document)
Get the pipe settings of the project.
document:
The document.
Returns:
The pipe settings of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.ConnectorSeparator
The connector separator string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.SizePrefix
The size prefix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.SizeSuffix
The size suffix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.Centerline
The abbreviation of the Centerline (=) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Plumbing.PipeSettings.SetDownFromBottom
The abbreviation of the Set Down from bottom of fitting (SDB) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Plumbing.PipeSettings.SetUpFromBottom
The abbreviation of the Set Up from bottom of fitting(SUB) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Plumbing.PipeSettings.SetDown
The abbreviation of the Set Down (SD) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Plumbing.PipeSettings.SetUp
The abbreviation of the Set Up (SU) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Plumbing.PipeSettings.FlatOnBottom
The abbreviation of the Flat On Bottom (FOB) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Plumbing.PipeSettings.FlatOnTop
The abbreviation of the Flat On Top (FOT) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017